[Réunir plusieurs tableaux Excel par formule Python](https://www.youtube.com/watch?v=fuPStPpofJU&list=PLpQBnWleLAauKmgcdndmEr81iIIoW9_Wi&index=20)

Date : 27/05/2025

In [1]:
import pandas as pd

In [4]:
tab1 = pd.read_excel('data/Concat.xlsx', sheet_name='Citroen')
tab1.head()

     Immat.   Marque Modèle
0  2677XT74  CITROEN     C3
1   AC454BD  CITROEN     C4
2   AJ007PV  CITROEN     C4
3   BB978MC  CITROEN     C5
4   BQ561JM  CITROEN   NEMO

In [5]:
tab2 = pd.read_excel('data/Concat.xlsx', sheet_name='Peugeot')
tab2.head()

     Immat.   Marque  Modèle
0   2020JNY  PEUGEOT     208
1   2043JNY  PEUGEOT     308
2   2069JNY  PEUGEOT     308
3  5495ZQ74  PEUGEOT     206
4   8033JPB  PEUGEOT     308

In [6]:
tab3 = pd.read_excel('data/Concat.xlsx', sheet_name='Renault')
tab3.head()

     Immat.   Marque  Modèle
0  112CSB59  RENAULT   MODUS
1  1702WK74  RENAULT  TWINGO
2   92BLK57  RENAULT  TWINGO
3   AB479LG  RENAULT  ESPACE
4   AJ969LZ  RENAULT    CLIO

Concaténation des tables ci-avant

In [9]:
assemb=pd.concat([tab1, tab2, tab3]).reset_index(drop=True)
assemb.head()

     Immat.   Marque Modèle
0  2677XT74  CITROEN     C3
1   AC454BD  CITROEN     C4
2   AJ007PV  CITROEN     C4
3   BB978MC  CITROEN     C5
4   BQ561JM  CITROEN   NEMO